#+title: Javascript

* Nullish coalescing operator '??'

~a ?? b~ returns a if a is defined and not null, else it returns b.


#+begin_src js
function get() {
  let value = Math.random() * 10
  if (value > 5)
    return value
  return null
}

let a = get()
let defaultValue = 5
let result = a ?? defaultValue
return result
#+end_src

#+RESULTS:
: 7.966690608108928

Comparing with ~||~ operator, ~||~ does not distinguish between "falsey" values and undefined values, that is ~??~ treats ~""~ as a defined value and returns it, while ~||~ treats it as "falsey" and returns the other one

